{
    "load_error.1": "After running the project, please obtain the webview address and paste it into the multidimensional table \"expansion script\" for use. For details, see: ",
    "load.guide": "Development Guide",
    "btn.search": "Search",
    "action": "action",
    "open.new.window": "Open in new window",
    "search.label": "Search content",
    "plz.enter.1": "Please enter search content",
    "search.tooltip": "More powerful search: Search the original data format, you can search the person's email, attachment file type, group link and other data that are not directly displayed in the table; the search results will be presented in the original data. Note: Turn this on The ^$ in the final regular expression will be invalid",
    "search.usereg": "Search content using regular expressions",
    "search.detail": "Fine search",
    "search.table.label": "Search range-data table",
    "search.table.desc": "Please select a data table",
    "uploading.now": "Uploading:",
    "upload.error": "Upload error",
    "function.errot": "Function operation error",
    "function.dealare.error": "Function declaration error, please check the code",
    "compares.tooltip": "Use the custom function pickFile to determine which files will be uploaded for each row of records. The fields selected by this option will be used as parameters of the pickFile function",
    "pickFile.label": "Customized file selection rules",
    "please.choose.file": "Please choose the file",
    "selected.num.file": "{{num}} files have been selected",
    "upload.end": "File upload completed",
    "upload.file": "Upload file",
    "overWrite.exit.file": "Overwrite existing file",
    "select.pickField": "Select matching field",
    "select.fileFieldId": "Select attachment field",
    "select.view": "Select view",
    "select.table": "Select data table",
    "is.matching": "Matching fields and attachments",
    "btn.add.upload.file": "Upload file",
    "file.field.missing": "The attachment field is not found in the current view. Please add the attachment field and re-run the plug-in or switch views",
    "upload.by.new.record": "Batch upload files, one file generates a new record",
    "upload.by.new.record.title": "Batch upload files to new records",
    "upload.by.name.title": "Upload file matching field name",
    "upload.by.name.desc": "1. This mode supports uploading files to the record corresponding to the file name. Please ensure that the file name and the matching name are exactly the same;\n2. If the matching field contains multiple names, the attachment will also Automatically match and upload (please use,,.,;; spaces or newlines to separate multiple names);\n3. Text fields are supported by default. If you need to use other fields, please customize the file selection rules",
    "code.1": "This function will act on all records and then select the files needed for the record",
    "code.2": "Use a multi-line text as the identification field, and according to the file name filled in the identification field (use,,.,;; space or newline separation), find the corresponding file in the selected file file and upload it to the attachment field of the row record",
    "code.4": "compareValues: The original value array of the selected identification field cell of the current record, in the same order as the selected option",
    "code.3": "Upload the file according to the file name of the selected identification field",
    "code.5": "This line records the value of the first identification field (take a multi-line text field as an example)",
    "code.6": "fileList: selected files",
    "code.7": "The field value of multi-line text type is array/null, and empty records are filtered out",
    "code.8": "Get the file name using the interval from the identification field",
    "code.9": "File name (excluding file suffix)",
    "code.10": "Filter the required files according to the identification field",
    "code.21": "If no file is matched, the original attachment is used",
    "code.23": "This function will act on all records, and then select the files needed for the record (the priority is lower than the overwrite existing file switch below)",
    "self.reg": "Custom delimiter",
    "code.24": "compareValues: The original value array of the selected identification field cell of the current record, in the same order as the selected option",
    "code.25": "fileList: list of all selected files",
    "code.26": "currentValue: the value of the selected attachment field in the current record",
    "self.reg.tooltip": "Treat each character as a separator to separate the file names in the matching field",
    "choose.mode": "choose mode",
    "space": "space",
    "e": "Line break",
    "btn.preview": "File upload preview"
}