{
    "load_error.1": "Sau khi chạy dự án, vui lòng lấy địa chỉ webview và dán vào bảng đa chiều \"tập lệnh mở rộng\" để sử dụng. Để biết chi tiết, xem: ",
    "load.guide": "Hướng dẫn phát triển",
    "btn.search": "Tìm kiếm",
    "hành động": "hành động",
    "open.new.window": "Mở trong cửa sổ mới",
    "search.label": "Tìm kiếm nội dung",
    "plz.enter.1": "Vui lòng nhập nội dung tìm kiếm",
    "search.tooltip": "Tìm kiếm mạnh mẽ hơn: Tìm kiếm ở định dạng dữ liệu gốc, bạn có thể tìm kiếm email của người đó, loại tệp đính kèm, liên kết nhóm và các dữ liệu khác không được hiển thị trực tiếp trong bảng; kết quả tìm kiếm sẽ được trình bày trong dữ liệu gốc. Lưu ý: Bật tính năng này ^$ trong biểu thức chính quy cuối cùng sẽ không hợp lệ",
    "search.usereg": "Tìm kiếm nội dung bằng biểu thức chính quy",
    "search.detail": "Tìm kiếm tốt",
    "search.table.label": "Tìm kiếm bảng dữ liệu phạm vi",
    "search.table.desc": "Vui lòng chọn bảng dữ liệu",
    "uploading.now": "Đang tải lên:",
    "upload.error": "Lỗi tải lên",
    "function.errot": "Lỗi vận hành hàm",
    "function.dealare.error": "Lỗi khai báo hàm, vui lòng kiểm tra mã",
    "compares.tooltip": "Sử dụng hàm tùy chỉnh pickFile để xác định tập tin nào sẽ được tải lên cho mỗi hàng bản ghi. Các trường được chọn bởi tùy chọn này sẽ được sử dụng làm tham số của hàm pickFile",
    "pickFile.label": "Quy tắc chọn tập tin tùy chỉnh",
    "please.choose.file": "Xin hãy chọn tập tin",
    "selected.num.file": "{{num}} tệp đã được chọn",
    "upload.end": "Hoàn tất tải tập tin lên",
    "upload.file": "Tải tập tin lên",
    "overWrite.exit.file": "Ghi đè tập tin hiện có",
    "select.pickField": "Chọn trường phù hợp",
    "select.fileFieldId": "Chọn trường đính kèm",
    "select.view": "Chọn chế độ xem",
    "select.table": "Chọn bảng dữ liệu",
    "is.matching": "So khớp các trường và tệp đính kèm",
    "btn.add.upload.file": "Tải tập tin lên",
    "file.field.missing": "Không tìm thấy trường đính kèm trong chế độ xem hiện tại. Vui lòng thêm trường đính kèm và chạy lại plug-in hoặc chuyển đổi chế độ xem",
    "upload.by.new.record": "Tải lên hàng loạt tập tin, một tập tin sẽ tạo ra một bản ghi mới",
    "upload.by.new.record.title": "Tải hàng loạt tập tin lên bản ghi mới",
    "upload.by.name.title": "Tải lên tập tin trùng với tên trường",
    "upload.by.name.desc": "1. Chế độ này hỗ trợ tải tệp lên bản ghi tương ứng với tên tệp. Hãy đảm bảo rằng tên tệp và tên trùng khớp hoàn toàn giống nhau;\n2. Nếu trường khớp chứa nhiều tên, tệp đính kèm cũng sẽ Tự động khớp và tải lên (vui lòng sử dụng,,.,;; dấu cách hoặc dòng mới để phân tách nhiều tên);\n3. Các trường văn bản được hỗ trợ theo mặc định. Nếu bạn cần sử dụng các trường khác, vui lòng tùy chỉnh quy tắc chọn tập tin",
    "code.1": "Chức năng này sẽ hoạt động trên tất cả các bản ghi và sau đó chọn các tập tin cần thiết cho bản ghi",
    "code.2": "Sử dụng văn bản nhiều dòng làm trường nhận dạng và theo tên tệp được điền vào trường nhận dạng (sử dụng,,.,;; phân tách dấu cách hoặc dòng mới), tìm tệp tương ứng trong phần đã chọn tệp và tải nó lên trường đính kèm của bản ghi hàng",
    "code.4": "compareValues: Mảng giá trị ban đầu của ô trường nhận dạng đã chọn của bản ghi hiện tại, theo cùng thứ tự với tùy chọn đã chọn",
    "code.3": "Tải file lên theo tên file của trường nhận dạng đã chọn",
    "code.5": "Dòng này ghi lại giá trị của trường nhận dạng đầu tiên (lấy trường văn bản nhiều dòng làm ví dụ)",
    "code.6": "fileList: các tập tin đã chọn",
    "code.7": "Giá trị trường của loại văn bản nhiều dòng là mảng/null và các bản ghi trống sẽ được lọc ra",
    "code.8": "Lấy tên tập tin bằng cách sử dụng khoảng thời gian từ trường nhận dạng",
    "code.9": "Tên tệp (không bao gồm hậu tố tệp)",
    "code.10": "Lọc các tập tin cần thiết theo trường nhận dạng",
    "code.21": "Nếu không có tập tin nào trùng khớp, tập tin đính kèm gốc sẽ được sử dụng",
    "code.23": "Chức năng này sẽ hoạt động trên tất cả các bản ghi, sau đó chọn các tệp cần thiết cho bản ghi (mức độ ưu tiên thấp hơn nút chuyển ghi đè tệp hiện có bên dưới)",
    "self.reg": "Dấu phân cách tùy chỉnh",
    "code.24": "compareValues: Mảng giá trị ban đầu của ô trường nhận dạng đã chọn của bản ghi hiện tại, theo cùng thứ tự với tùy chọn đã chọn",
    "code.25": "fileList: danh sách tất cả các tập tin đã chọn",
    "code.26": "currentValue: giá trị của trường đính kèm đã chọn trong bản ghi hiện tại",
    "self.reg.tooltip": "Coi mỗi ký tự là dấu phân cách để phân tách tên tệp trong trường khớp",
    "choose.mode": "chọn chế độ",
    "dấu cách": "dấu cách",
    "e":"Ngắt dòng",
    "btn.preview": "Xem trước tập tin tải lên"
}